Revit 2027 API
ElementQuickFilter Class
 A base class for a type of filter that operates on element records.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementQuickFilter : ElementFilter
Public Class ElementQuickFilter
	Inherits ElementFilter
public ref class ElementQuickFilter : public ElementFilter
type ElementQuickFilter =
    class
        inherit ElementFilter
    end
The ElementQuickFilter type exposes the following members.
Properties
Name | Description
Inverted |  True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
(Inherited from ElementFilter)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ElementFilter)
Top
Methods
Name | Description
Dispose
(Inherited from ElementFilter)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
PassesFilter(Element) |  Applies the filter to a given element.
(Inherited from ElementFilter)
PassesFilter(Document, ElementId) |  Applies the filter to a given element.
(Inherited from ElementFilter)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.BoundingBoxContainsPointFilter
 Autodesk.Revit.DB.BoundingBoxIntersectsFilter
 Autodesk.Revit.DB.BoundingBoxIsInsideFilter
 Autodesk.Revit.DB.ElementCategoryFilter
 Autodesk.Revit.DB.ElementClassFilter
 Autodesk.Revit.DB.ElementDesignOptionFilter
 Autodesk.Revit.DB.ElementIdSetFilter
 Autodesk.Revit.DB.ElementIsCurveDrivenFilter
 Autodesk.Revit.DB.ElementIsElementTypeFilter
 Autodesk.Revit.DB.ElementMulticategoryFilter
 Autodesk.Revit.DB.ElementMulticlassFilter
 Autodesk.Revit.DB.ElementOwnerViewFilter
 Autodesk.Revit.DB.ElementStructuralTypeFilter
 Autodesk.Revit.DB.ElementWorksetFilter
 Autodesk.Revit.DB.ExclusionFilter
 Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter
 Autodesk.Revit.DB.FamilySymbolFilter
 Autodesk.Revit.DB.VisibleInViewFilter